InformationRegisters/СтажерыПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СтажерыПредприятия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наставник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоСтажировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонецСтажировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Comment>1 - пройдена, 2 - не пройдена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Стажер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтажерыПредприятия/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Запись.Стажер = Запись.Наставник Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Стажер не может быть наставником сам себе";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	Если Запись.КонецСтажировки < Запись.НачалоСтажировки Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Начало стажировки не может быть позже окончания";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не РольДоступна("ПолныеПрава") Тогда
		Если Запись.Менеджер <> ПараметрыСеанса.ТекущийПользователь Тогда
			ЭтаФорма.ТолькоПросмотр = Истина;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Редактирование записи других менеджеров запрещено, обратитесь к администратору";
			Сообщение.Сообщить();
		КонецЕсли;	
	КонецЕсли;	
	Если Запись.КонецСтажировки <= ТекущаяДата() Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Редактирование записи запрещено, по ней уже было начисление";
		Сообщение.Сообщить();
	КонецЕсли;	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Запись.Менеджер = Неопределено;
		Запись.Результат = 0;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Запись.Менеджер) Тогда
		Запись.Менеджер = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры
